'''
--------------------------------------------------
numpy.logspace
numpy.logspace 函数用于创建一个于等比数列。格式如下：

np.logspace(start, stop, num=50, endpoint=True, base=10.0, dtype=None)
base 参数意思是取对数的时候 log 的下标。

参数         描述
start       序列的起始值为：base ** start
stop        序列的终止值为：base ** stop。如果endpoint为true，该值包含于数列中
num         要生成的等步长的样本数量，默认为50
endpoint    该值为 true 时，数列中中包含stop值，反之不包含，默认是True。
base        对数 log 的底数。
dtype       ndarray 的数据类型

--------------------------------------------------
'''

# 将对数的底数设置为 2 :

import numpy as np
a = np.logspace(0, 9, num=10, base=2)
print('np.logspace(0, 9, num=10, base=2)')
print(a)

a = np.logspace(0, 9, base=2)
print('np.logspace(0, 9, base=2)')
print(a)

'''
np.logspace(0, 9, num=10, base=2)
[  1.   2.   4.   8.  16.  32.  64. 128. 256. 512.]
np.logspace(0, 9, base=2)
[  1.           1.13577217   1.28997843   1.4651216    1.66404434
   1.88997526   2.1465813    2.43802731   2.76904357   3.14500263
   3.57200647   4.05698555   4.60781129   5.23342383   5.94397716
   6.75100385   7.6676023    8.70864932   9.89104156  11.23396975
  12.75923023  14.49157863  16.45913174  18.6938238   21.23192486
  24.11462942  27.38872504  31.10735173  35.33086444  40.12781264
  45.57605293  51.76401263  58.79212506  66.77445958  75.840573
  86.13761233  97.83270305 111.11566165 126.20207638 143.33680642
 162.79795596 184.90138806 210.00585114 238.5188017  270.90301749
 307.6841086  349.45904834 396.9058624  450.79463345 512.        ]
'''

# 如果不指定生成数组的长度，默认为 50